# 1. Ordinal Number Encoding

In [3]:
import datetime

In [7]:
today_date=datetime.datetime.today()
today_date

datetime.datetime(2021, 1, 14, 23, 4, 9, 433171)

In [8]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 1, 11, 23, 4, 9, 433171)

In [10]:
### List comprehension
days=[today_date-datetime.timedelta(x) for x  in range(0,15)]
days

[datetime.datetime(2021, 1, 14, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 13, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 12, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 11, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 10, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 9, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 8, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 7, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 6, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 5, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 4, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 3, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 2, 23, 4, 9, 433171),
 datetime.datetime(2021, 1, 1, 23, 4, 9, 433171),
 datetime.datetime(2020, 12, 31, 23, 4, 9, 433171)]

In [11]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=['Days']
data.head()

                        Days
0 2021-01-14 23:04:09.433171
1 2021-01-13 23:04:09.433171
2 2021-01-12 23:04:09.433171
3 2021-01-11 23:04:09.433171
4 2021-01-10 23:04:09.433171

In [15]:
data['weekday']=data['Days'].dt.weekday
data.head()

                        Days  weekday
0 2021-01-14 23:04:09.433171        3
1 2021-01-13 23:04:09.433171        2
2 2021-01-12 23:04:09.433171        1
3 2021-01-11 23:04:09.433171        0
4 2021-01-10 23:04:09.433171        6

In [18]:
dictionary={
    1:'Monday',
    2:'Tuesday',
    3:'Wednesday',
    4:'Thursday',
    5:'Friday',
    6:'Saturday',
    0:'Sunday'
    
}
dictionary

{1: 'Monday',
 2: 'Tuesday',
 3: 'Wednesday',
 4: 'Thursday',
 5: 'Friday',
 6: 'Saturday',
 0: 'Sunday'}

In [19]:
data['weekday_ordinal']=data['weekday'].map(dictionary)
data

                         Days  weekday weekday_ordinal
0  2021-01-14 23:04:09.433171        3       Wednesday
1  2021-01-13 23:04:09.433171        2         Tuesday
2  2021-01-12 23:04:09.433171        1          Monday
3  2021-01-11 23:04:09.433171        0          Sunday
4  2021-01-10 23:04:09.433171        6        Saturday
5  2021-01-09 23:04:09.433171        5          Friday
6  2021-01-08 23:04:09.433171        4        Thursday
7  2021-01-07 23:04:09.433171        3       Wednesday
8  2021-01-06 23:04:09.433171        2         Tuesday
9  2021-01-05 23:04:09.433171        1          Monday
10 2021-01-04 23:04:09.433171        0          Sunday
11 2021-01-03 23:04:09.433171        6        Saturday
12 2021-01-02 23:04:09.433171        5          Friday
13 2021-01-01 23:04:09.433171        4        Thursday
14 2020-12-31 23:04:09.433171        3       Wednesday

# 2 . Count or Frequency Encoding

In [20]:
import pandas as pd
#train_set=pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
train_set=pd.read_csv('train_set.csv',header=None,index_col=False)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [21]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [22]:
len(train_set[1].unique())

9

In [23]:
columns=[1,3,5,6,7,8,9,13]

In [25]:
train_set=train_set[columns]

In [27]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [28]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [29]:
for feature in train_set.columns[:]:
    print(feature," : ",len(train_set[feature].unique()), 'labels')

Employment  :  9 labels
Degree  :  16 labels
Status  :  7 labels
Designation  :  15 labels
family_job  :  6 labels
Race  :  5 labels
Sex  :  2 labels
Country  :  42 labels

In [30]:
train_set['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [31]:
train_set['Country'].value_counts().to_dict()

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [32]:
country_map=train_set['Country'].value_counts().to_dict()

In [33]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

# Target guided Ordinal Encoding

In [34]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [35]:
df['Cabin'].fillna('Missing',inplace=True)

In [36]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [37]:
df['Cabin'].astype(str).str[0]

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [39]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [40]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [41]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [42]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [43]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [44]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [45]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [46]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [ ]:
# Now we can drop Cabin column . 
# This is based on the target values

# 4. Mean Encoding

In [48]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [49]:
df.groupby(['Cabin'])['Survived'].mean().to_dict()

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [50]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [51]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

# Repractice

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2021, 3, 27, 18, 33, 47, 263754)

In [4]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 3, 24, 18, 33, 47, 263754)

In [5]:
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [6]:
days

[datetime.datetime(2021, 3, 27, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 26, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 25, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 24, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 23, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 22, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 21, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 20, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 19, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 18, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 17, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 16, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 15, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 14, 18, 33, 47, 263754),
 datetime.datetime(2021, 3, 13, 18, 33, 47, 263754)]

In [8]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Days"]
data.head()

                        Days
0 2021-03-27 18:33:47.263754
1 2021-03-26 18:33:47.263754
2 2021-03-25 18:33:47.263754
3 2021-03-24 18:33:47.263754
4 2021-03-23 18:33:47.263754

In [13]:
data['weekday']=data['Days'].dt.weekday
data.head()

                        Days  weekday
0 2021-03-27 18:33:47.263754        5
1 2021-03-26 18:33:47.263754        4
2 2021-03-25 18:33:47.263754        3
3 2021-03-24 18:33:47.263754        2
4 2021-03-23 18:33:47.263754        1

In [20]:
dictionary={
    1:'Monday',
    2:'Tuesday',
    3:'Wednesday',
    4:'Thursday',
    5:'Friday',
    6:'Saturday',
    0:'Sunday'
}

In [21]:
dictionary

{1: 'Monday',
 2: 'Tuesday',
 3: 'Wednesday',
 4: 'Thursday',
 5: 'Friday',
 6: 'Saturday',
 0: 'Sunday'}

In [22]:
data['weekday'].map(dictionary)

0        Friday
1      Thursday
2     Wednesday
3       Tuesday
4        Monday
5        Sunday
6      Saturday
7        Friday
8      Thursday
9     Wednesday
10      Tuesday
11       Monday
12       Sunday
13     Saturday
14       Friday
Name: weekday, dtype: object

In [23]:
data['weekend_ordinal']=data['weekday'].map(dictionary)
data

                         Days  weekday weekend_ordinal
0  2021-03-27 18:33:47.263754        5          Friday
1  2021-03-26 18:33:47.263754        4        Thursday
2  2021-03-25 18:33:47.263754        3       Wednesday
3  2021-03-24 18:33:47.263754        2         Tuesday
4  2021-03-23 18:33:47.263754        1          Monday
5  2021-03-22 18:33:47.263754        0          Sunday
6  2021-03-21 18:33:47.263754        6        Saturday
7  2021-03-20 18:33:47.263754        5          Friday
8  2021-03-19 18:33:47.263754        4        Thursday
9  2021-03-18 18:33:47.263754        3       Wednesday
10 2021-03-17 18:33:47.263754        2         Tuesday
11 2021-03-16 18:33:47.263754        1          Monday
12 2021-03-15 18:33:47.263754        0          Sunday
13 2021-03-14 18:33:47.263754        6        Saturday
14 2021-03-13 18:33:47.263754        5          Friday

In [25]:
import pandas as pd
#train_set=pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
train_set=pd.read_csv('train_set.csv',header=None,index_col=False)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [26]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [27]:
len(train_set[1].unique())

9

In [32]:
columns=[1,3,5,6,7,8,9,13]

In [33]:
train_set=train_set[columns]
train_set.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [35]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [36]:
for col in train_set[:]:
    print(col,":",len(train_set[col].unique())," labels")

Employment : 9  labels
Degree : 16  labels
Status : 7  labels
Designation : 15  labels
family_job : 6  labels
Race : 5  labels
Sex : 2  labels
Country : 42  labels

In [38]:
train_set['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [40]:
country_map=train_set['Country'].value_counts().to_dict()

In [41]:
train_set['Country']=train_set['Country'].map(country_map)

In [42]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

In [43]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [44]:
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [46]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [47]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [50]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [57]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [53]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [59]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [61]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [3]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [4]:
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [5]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [7]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [8]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [10]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  mean_ordinal_encode
0         0     M             0.299854
1         1     C             0.593220
2         1     M             0.299854
3         1     C             0.593220
4         0     M             0.299854

In [11]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [12]:
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [13]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [14]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [17]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()
prob_df

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [18]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [19]:
prob_df['Died']=1-prob_df['Survived']
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [20]:
prob_df['Probability_Ratio']=prob_df['Survived']/prob_df['Died']
prob_df.head()

       Survived      Died  Probability_Ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [22]:
probability_encoded=prob_df['Probability_Ratio'].to_dict()

In [23]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [25]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)

df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274